CSI API ETABS v1

# cDesignResultsDesignForces Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignForces DesignForces { get; }

    ReadOnly Property DesignForces As cDesignForces
    	Get

    Dim instance As cDesignResults
    Dim value As cDesignForces

    value = instance.DesignForces

    property cDesignForces^ DesignForces {
    	cDesignForces^ get ();
    }

    abstract DesignForces : cDesignForces with get

#### Property Value

Type: cDesignForces

See Also

#### Reference

cDesignResults Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com